#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-c9vSDAj6kNS4E93A

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=c6c2cc78eb9c4f026324c659f366f7412e0c00adc58266553d8a47ad2362166c]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=1089363423]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=1407615633]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=2377160203]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state... [id=931116587]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=315687832]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state... [id=1116480091]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder-spot-fleet-role]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116212912287200000003]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116212912312400000004]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116212912128900000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116212912375000000005]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323839200000002]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323938600000003]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
aws_security_group.allow_icmp: Refreshing state... [id=sg-01794fd088245ef29]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04c3b57abc095a9ab]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-ddf2b10d-b0d7-4f6b-822d-7a71737fdc10]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_x86" {
        arn                     = "arn:aws:ec2:us-east-1:933752197999:launch-template/lt-0cbb229d67d85ee00"
      ~ default_version         = 1 -> (known after apply)
        disable_api_termination = false
        id                      = "lt-0cbb229d67d85ee00"
        image_id                = "ami-0c82f7789103a1e20"
        instance_type           = "t3.medium"
        key_name                = "mhayden"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "imagebuilder-worker-x86"
        security_group_names    = []
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder worker"
            "ServiceOwner" = "Image Builder"
        }
        update_default_version  = true
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybQpIT1NUTkFNRT13b3JrZXItZmxlZXQtdGVzdGluZwoKIyBTZXQgdGhlIGhvc3RuYW1lIHRvIHRoZSBob3N0bmFtZSBwYXNzZWQgYnkgdGVycmFmb3JtLgpob3N0bmFtZWN0bCBzZXQtaG9zdG5hbWUgJFNZU1RFTV9IT1NUTkFNRQoKZG5mIC15IHVwZ3JhZGUKCg==" -> "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybQpTWVNURU1fSE9TVE5BTUU9d29ya2VyLWZsZWV0LXRlc3RpbmcKCiMgU2V0IHRoZSBob3N0bmFtZSB0byB0aGUgaG9zdG5hbWUgcGFzc2VkIGJ5IHRlcnJhZm9ybS4KaG9zdG5hbWVjdGwgc2V0LWhvc3RuYW1lICRTWVNURU1fSE9TVE5BTUUKCmRuZiAteSBpbnN0YWxsIGNvY2twaXQgb3NidWlsZC1jb21wb3NlcgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IGNvY2twaXQuc29ja2V0CnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1jb21wb3Nlci5zb2NrZXQKCg=="
      ~ vpc_security_group_ids  = [
          - "sg-01794fd088245ef29",
          - "sg-04c3b57abc095a9ab",
        ] -> (known after apply)

        block_device_mappings {
            device_name = "/dev/sda1"

            ebs {
                iops        = 0
                volume_size = 50
                volume_type = "gp2"
            }
        }

        tag_specifications {
            resource_type = "instance"
            tags          = {
                "AppCode"      = "IMGB-001"
                "Name"         = "Image Builder worker"
                "ServiceOwner" = "Image Builder"
            }
        }
        tag_specifications {
            resource_type = "volume"
            tags          = {
                "AppCode"      = "IMGB-001"
                "Name"         = "Image Builder worker"
                "ServiceOwner" = "Image Builder"
            }
        }
    }

  # aws_security_group.allow_cockpit will be created
  + resource "aws_security_group" "allow_cockpit" {
      + arn                    = (known after apply)
      + description            = "Allow cockpit access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "cockpit"
              + from_port        = 9090
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9090
            },
        ]
      + name                   = "allow-cockpit"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "allow-cockpit"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_security_group.allow_egress will be created
  + resource "aws_security_group" "allow_egress" {
      + arn                    = (known after apply)
      + description            = "Allow egress traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow-egress"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "allow-egress"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_spot_fleet_request.imagebuilder_worker_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "imagebuilder_worker_x86" {
        allocation_strategy                 = "lowestPrice"
      ~ client_token                        = "terraform-20201116215323744200000001" -> (known after apply)
        excess_capacity_termination_policy  = "Default"
        fleet_type                          = "maintain"
        iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder-spot-fleet-role"
      ~ id                                  = "sfr-ddf2b10d-b0d7-4f6b-822d-7a71737fdc10" -> (known after apply)
        instance_interruption_behaviour     = "terminate"
        instance_pools_to_use_count         = 1
      ~ load_balancers                      = [] -> (known after apply)
        replace_unhealthy_instances         = false
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder worker fleet"
            "ServiceOwner" = "Image Builder"
        }
        target_capacity                     = 1
      ~ target_group_arns                   = [] -> (known after apply)
        terminate_instances_with_expiration = true
        wait_for_fulfillment                = false

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0cbb229d67d85ee00" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0cbb229d67d85ee00"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*